{"version": "v2.0","data": [{"title": "your_title","paragraphs": [{"qas": [{"question": "In what year is PHP invented ?","id": "0","is_impossible": ""}],"context": "and real gels was written in PHP and Java® (see availability). The tag specifications are constantly being updated; as such please see the AGML 1.0 web site for the latest tag descriptions (see availability). Data Input and Data Display The method employed was generated for processing and display of data generated by PDQUEST® software (Bio- RAD, Hercules, CA, USA). However, the proposed XML schema can be used to annotate any type of 2DE gel data. The AGML data is displayed by way of a Java applet through a web interface (Fig. 2). The current implementa­ tion displays a web page that includes the virtual gel and sample information. Links are provided to access the real gels and spot information. Text file generated from PDQUEST can easily be uploaded, XML generated and viewed. The spots that are in the virtual gel are highlighted in the real gels with a different color to indicate where each spot came from. Discussion The aim of this paper is to propose standard XML syntax for data exchange and visualization of 2DE/MS experi­ mental data that is designated as the annotated gel http://www.biomedcentral.com/1471-2105/5/9 markup language (AGML). However, this does not limit adapting AGML, a XML application, for data storage [13]. The proposed AGML syntax captures the essence of a 2D gel experiment and its pertinent MS data, and conveys enough information to analyze and replicate the results. The need to go beyond a format for data storage in the development of the AGML syntax is justified by the diverse set of methods involved and, the enduring obsta­ cles to full automation. The need for a common format to manipulate as well as to store the data is captured by the concept of annotated virtual gel. This practical solution was reflected in the identification of the data model and ultimately mimicked by the AGML schema. AGML syntax could easily be adapted by other applica­ tions to present the data in XML format. In this specific application the 2DE experimental data was generated using PDQUEST coupled with a MicroMass MALDI-TOF instrument using MassLynx and Micromass global server software for protein identification (MicroMass, Manches­ ter, U.K.). The data generated from a 2DE/MS experiment using the above instrumentation is stored using the man­ ufacturer specific formatting as tab-delimited files. This text file is then converted to AGML syntax through a web interface using software written in PHP (see availability). The conversion of the tab-delimited file to AGML syntax and, if requested, web-based graphical representation, is fully automated. The latter application illustrates the advantage of using AGML as a common format as the graphical displaying is in effect a web-based service avail­ able for any dataset represented in our proposed AGML syntax notation. Registered users can then decide whether to deposit the AGML to the database. Since AGML con­ forms to the XML rules, it's highly flexible and simple to modify [5]. This adaptability of the syntax, also known as content scalability, helps in defining new elements when new information is acquired through 2DE/MS experi­ ments. This is a great asset in an emerging field like pro­ teomics where new information is discovered at a rapid pace, which requires a constant adaptation of the prevail­ ing data model. In the field of bioinformatics experimental data needs to be analyzed, stored, updated and exchanged often by researchers [5]. To this effect, a bioinformatics infrastruc­ ture built around AGML will fulfill all these aspects for 2DE/MS experimental data. The ultimate goal of develop­ ing the AGML syntax, is to enable proteomics research to move into the 'browsing mode' of searching through exist­ ing information databases along similar lines as proposed by Aebersold [14,15]. The proposed AGML document contains the experimental procedure, the experimental results and the composite vir­ tual gel. It is useful to compare the proposed standards Page 4 of 7 (page number not for citation purposes) A Sample screenshot of the AGML Visualizer in action BMC Bioinformatics 2004, 5 http://www.biomedcentral.com/1471-2105/5/9 Figure 2 A Sample screenshot of the AGML Visualizer in action. AGML Visualizer software is capable of reading AGML documents and display a visual representation of virtual and real gels described in the AGML document instance. In this representative figure, the real gel is shown as the small figure atop the virtual gel. Left side of the gel depicts all the pertinent information regarding the gel (gel information as described in methods). The right side of the gel displays the information on a particular spot (spot information as described in methods). The AGML Visualizer is based on the AGML schema proposed in this paper. with related work in transcriptomics. For example, MAGE­ ML [16] has the representation of DNA array data in XML format as the sole purpose. A similar focus on representa­ tion of data is found in ProML [17], which only includes the protein sequence information while not making allowances for the description of the methodological pro­ cedure followed. The advantage in incorporating both the experimental procedure and the results, as we have pro­ posed in AGML, is that the data could be understood in the context of the experiment. The methodological detail facilitates repeating the experiment documented in AGML by another researcher. Arguably, the need to include methodological detail in AGML reflects unresolved meth­ odological challenges in proteomic profiling based on 2D gel electrophoresis, a lesser problem in sequencing or transcriptomics projects. AGML can be incorporated to be used with large descrip­ tors of proteomics information. Using XML namespace rules, AGML markup can easily be incorporated into any other schema. Specifically, the PEDRo model proposed by Taylor et al. explicitly accommodates the representation of 2DE/MS data [12] where AGML could be particularly useful. AGML by no way replaces the structure envisioned by PEDRo; instead proposes an XML format for handling 2DE/MS data that can be incorporated into the existing large schemas such as PEDRo. In order to transmit subsets of information from this repository, the PEDRo model has to employ other methods [12]. Accordingly, the PEDRo model could"}]}]}